{"modelTopology": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 48, 48, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "separable_conv2d_20_input"}, "registered_name": null}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_20", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 48, 48, 1], "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 1]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_21", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_22", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 48, 48, 48]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"rate": 0.1, "noise_shape": null, "seed": null, "name": "spatial_dropout2d_8"}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 48]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 48]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_23", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 48]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_24", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_25", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 96]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"rate": 0.1, "noise_shape": null, "seed": null, "name": "spatial_dropout2d_9"}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 96]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 96]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_26", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 96]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 192]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 192]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_27", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 192]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 192]}}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 192]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"rate": 0.1, "noise_shape": null, "seed": null, "name": "spatial_dropout2d_10"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 192]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 192]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_28", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 192]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 384]}}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_11", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 384]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"rate": 0.1, "noise_shape": null, "seed": null, "name": "spatial_dropout2d_11"}, "registered_name": null, "build_config": {"input_shape": [null, 3, 3, 384]}}, {"module": "keras.layers", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "dtype": "float32", "alpha": 0.019999999552965164}, "registered_name": null, "build_config": {"input_shape": [null, 3, 3, 384]}}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_29", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 3, 3, 384]}}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 3, 3, 8]}}]}, "keras_version": "2.15.0", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["model.weights.bin"], "weights": [{"name": "separable_conv2d_20/depthwise_kernel", "shape": [3, 3, 1, 1], "dtype": "float32"}, {"name": "separable_conv2d_20/pointwise_kernel", "shape": [1, 1, 1, 48], "dtype": "float32"}, {"name": "separable_conv2d_20/bias", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_18/gamma", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "separable_conv2d_21/depthwise_kernel", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "separable_conv2d_21/pointwise_kernel", "shape": [1, 1, 48, 48], "dtype": "float32"}, {"name": "separable_conv2d_21/bias", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_19/gamma", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "separable_conv2d_22/depthwise_kernel", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "separable_conv2d_22/pointwise_kernel", "shape": [1, 1, 48, 48], "dtype": "float32"}, {"name": "separable_conv2d_22/bias", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_20/gamma", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "separable_conv2d_23/depthwise_kernel", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "separable_conv2d_23/pointwise_kernel", "shape": [1, 1, 48, 96], "dtype": "float32"}, {"name": "separable_conv2d_23/bias", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_21/gamma", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "separable_conv2d_24/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "separable_conv2d_24/pointwise_kernel", "shape": [1, 1, 96, 96], "dtype": "float32"}, {"name": "separable_conv2d_24/bias", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_22/gamma", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "separable_conv2d_25/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "separable_conv2d_25/pointwise_kernel", "shape": [1, 1, 96, 96], "dtype": "float32"}, {"name": "separable_conv2d_25/bias", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_23/gamma", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "separable_conv2d_26/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "separable_conv2d_26/pointwise_kernel", "shape": [1, 1, 96, 192], "dtype": "float32"}, {"name": "separable_conv2d_26/bias", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_24/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "separable_conv2d_27/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "separable_conv2d_27/pointwise_kernel", "shape": [1, 1, 192, 192], "dtype": "float32"}, {"name": "separable_conv2d_27/bias", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_25/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "separable_conv2d_28/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "separable_conv2d_28/pointwise_kernel", "shape": [1, 1, 192, 384], "dtype": "float32"}, {"name": "separable_conv2d_28/bias", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_26/gamma", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "separable_conv2d_29/depthwise_kernel", "shape": [1, 1, 384, 1], "dtype": "float32"}, {"name": "separable_conv2d_29/pointwise_kernel", "shape": [1, 1, 384, 8], "dtype": "float32"}, {"name": "separable_conv2d_29/bias", "shape": [8], "dtype": "float32"}]}], "format": "layers-model", "generatedBy": "keras2tfjs", "convertedBy": null, "modelInitializer": {"className": "Model", "config": {"name": "emotion_model"}}}